     d FilterUP        pr                  extpgm('FILTERUP')
     d  rtnCode                       3i 0
     d  lStat                          *   const
     d  filters                        *   const
