     d FilterUP        pr                  extpgm('FILTERUP')
     d  rtnCode                       3i 0
     d  lFiles                         *   const
     d  ID                           10A   varying const
     d  filters                        *
