      //‚Grid update entry
     d GridUP          pr                  extpgm('GRIDUP')
     d  rtnCode                       3i 0
     d  GridID                       10    const
