     d jrnentdp        pr                  extpgm('JRNENTDP')
     d  rtnCode                       3i 0
     d  option                        1a
     d  ztl                         131
     d  lVariant                       *
     d  hDta                         10i 0
     d  lYViews                        *
     d  lFmts                          *
     d  lForms                         *
