     D JRNENTWW        pr                  extpgm('JRNENTWW')
     d  rtncode                       3u 0 const
     D  jrnPath                      50a   const
